CREATE TABLE [dbo].[check_total_alcorep] (
    [Остаток_на_начало_отчетного_периода]             DECIMAL (15, 5) NULL,
    [Сумма_закупки_в_декалитрах_орг_производителей]   DECIMAL (15, 5) NULL,
    [Сумма_закупки_в_декалитрах_орг_Оптовой_торговли] DECIMAL (15, 5) NULL,
    [Сумма_закупки_в_декалитрах_импорт]               DECIMAL (15, 5) NULL,
    [Поступление - закупки итого]                     DECIMAL (17, 5) NULL,
    [Поступление_возврат_от_покупателей]              DECIMAL (15, 5) NULL,
    [Прочие_поступления]                              DECIMAL (15, 5) NULL,
    [Приход_по_перемещениям]                          DECIMAL (15, 5) NULL,
    [Поступление - всего]                             DECIMAL (20, 5) NULL,
    [Реализация]                                      DECIMAL (15, 5) NULL,
    [Прочий_расход]                                   DECIMAL (15, 5) NULL,
    [Cумма_по_возвратам_поставщику_в_декалитрах]      DECIMAL (15, 5) NULL,
    [Расход_по_перемещениям]                          DECIMAL (15, 5) NULL,
    [Всего_расход]                                    DECIMAL (15, 5) NULL,
    [Остаток_на_конец]                                DECIMAL (15, 5) NULL
);

